#  GroupBy

In [2]:
import pandas as pd         # Importing Pandas

var = pd.DataFrame({"name":["a","b","c","d","a","b","b","a","a","c","c","d"],  # Crreating dataframe
                    "S_1":[12,13,14,12,13,14,15,23,25,16,10,34],
                    "S_2":[23,24,25,26,27,28,29,30,25,34,35,56]})

var            # Printing dataframe

   name  S_1  S_2
0     a   12   23
1     b   13   24
2     c   14   25
3     d   12   26
4     a   13   27
5     b   14   28
6     b   15   29
7     a   23   30
8     a   25   25
9     c   16   34
10    c   10   35
11    d   34   56

In [3]:
var_New = var.groupby('name')           # Grouping dataframe by "name" column and storing in var_New

var_New                      # Printing var_New

In [5]:
for x,y in var_New:         # creating a for loop to show rows & columns of var_New
    print(x)
    print(y)
    print()

a
  name  S_1  S_2
0    a   12   23
4    a   13   27
7    a   23   30
8    a   25   25

b
  name  S_1  S_2
1    b   13   24
5    b   14   28
6    b   15   29

c
   name  S_1  S_2
2     c   14   25
9     c   16   34
10    c   10   35

d
   name  S_1  S_2
3     d   12   26
11    d   34   56

In [6]:
var_New.get_group('a')        # Getting a single group from var_New

  name  S_1  S_2
0    a   12   23
4    a   13   27
7    a   23   30
8    a   25   25

In [7]:
var_New.get_group('d')       # Getting a single group from var_New

   name  S_1  S_2
3     d   12   26
11    d   34   56

In [9]:
var_New.min()       # Showing minimum values of each group

      S_1  S_2
name
a      12   23
b      13   24
c      10   25
d      12   26

In [10]:
var_New.max()      # Showing maximum values of each group

      S_1  S_2
name
a      25   30
b      15   29
c      16   35
d      34   56

In [11]:
var_New.mean()          # Showing mean of each group

            S_1        S_2
name
a     18.250000  26.250000
b     14.000000  27.000000
c     13.333333  31.333333
d     23.000000  41.000000

In [12]:
li = list(var_New)        # Converting into list and storing in variable "li"

li         # Printing "li"

[('a',
    name  S_1  S_2
  0    a   12   23
  4    a   13   27
  7    a   23   30
  8    a   25   25),
 ('b',
    name  S_1  S_2
  1    b   13   24
  5    b   14   28
  6    b   15   29),
 ('c',
     name  S_1  S_2
  2     c   14   25
  9     c   16   34
  10    c   10   35),
 ('d',
     name  S_1  S_2
  3     d   12   26
  11    d   34   56)]